Reports/20240629_230543/API Testing/20240629_230543/requests/main/6.har

{
  "log" : {
    "version" : "1.2",
    "pages" : [ ],
    "entries" : [ {
      "startedDateTime" : "2024-06-29T16:05:52.672Z",
      "request" : {
        "method" : "SOAP",
        "url" : "https://www.crcind.com/csp/samples/SOAP.Demo.CLS?WSDL=1",
        "httpVersion" : "",
        "cookies" : [ ],
        "headers" : [ {
          "name" : "SOAPAction",
          "value" : "http://tempuri.org/SOAP.Demo.GetByName"
        }, {
          "name" : "Content-Type",
          "value" : "text/xml; charset=utf-8"
        } ],
        "queryString" : [ {
          "name" : "WSDL",
          "value" : "1"
        } ],
        "postData" : {
          "mimeType" : "text/xml; charset=utf-8",
          "text" : "<soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:tem=\"http://tempuri.org\">\n   <soapenv:Header/>\n   <soapenv:Body>\n      <tem:GetByName>\n         <tem:name>gero et</tem:name>\n      </tem:GetByName>\n   </soapenv:Body>\n</soapenv:Envelope>",
          "comment" : ""
        },
        "headersSize" : 0,
        "bodySize" : 0,
        "comment" : ""
      },
      "response" : {
        "status" : 200,
        "statusText" : "",
        "httpVersion" : "",
        "cookies" : [ ],
        "headers" : [ {
          "name" : "Cache-Control",
          "value" : "no-cache"
        }, {
          "name" : "Server",
          "value" : "Microsoft-IIS/8.5"
        }, {
          "name" : "Set-Cookie",
          "value" : "CSPSESSIONID-SP-443-UP-csp-samples-=001000010000uBsLgulmIE0000X65xImDDHlealiFWgYGMEg--; path=/csp/samples/;  secure; httpOnly;"
        }, {
          "name" : "Set-Cookie",
          "value" : "CSPWSERVERID=e48a81c181e751dd2401aab2f799123a76d196ca; path=/; httpOnly; secure;"
        }, {
          "name" : "Pragma",
          "value" : "no-cache"
        }, {
          "name" : "Expires",
          "value" : "Thu, 29 Oct 1998 17:04:19 GMT"
        }, {
          "name" : "#status#",
          "value" : "HTTP/1.1 200 OK"
        }, {
          "name" : "Date",
          "value" : "Sat, 29 Jun 2024 16:07:30 GMT"
        }, {
          "name" : "Content-Type",
          "value" : "text/xml; charset=UTF-8"
        }, {
          "name" : "X-Powered-By",
          "value" : "ASP.NET"
        } ],
        "content" : {
          "size" : 1530,
          "mimeType" : "application/xml",
          "text" : "<?xml version=\"1.0\" encoding=\"UTF-8\" ?>\r\n<SOAP-ENV:Envelope xmlns:SOAP-ENV='http://schemas.xmlsoap.org/soap/envelope/' xmlns:xsi='http://www.w3.org/2001/XMLSchema-instance' xmlns:s='http://www.w3.org/2001/XMLSchema'>\r\n  <SOAP-ENV:Body><GetByNameResponse xmlns=\"http://tempuri.org\"><GetByNameResult>\r\n<s:schema id=\"ListByName\" xmlns=\"\" attributeFormDefault=\"qualified\" elementFormDefault=\"qualified\" xmlns:s=\"http://www.w3.org/2001/XMLSchema\" xmlns:msdata=\"urn:schemas-microsoft-com:xml-msdata\">\r\n  <s:element name=\"ListByName\" msdata:IsDataSet=\"true\">\r\n    <s:complexType>\r\n      <s:choice maxOccurs=\"unbounded\">\r\n        <s:element name=\"SQL\">\r\n          <s:complexType>\r\n            <s:sequence>\r\n              <s:element name=\"ID\" type=\"s:long\" minOccurs=\"0\" />\r\n              <s:element name=\"Name\" type=\"s:string\" minOccurs=\"0\" />\r\n              <s:element name=\"DOB\" type=\"s:date\" minOccurs=\"0\" />\r\n              <s:element name=\"SSN\" type=\"s:string\" minOccurs=\"0\" />\r\n            </s:sequence>\r\n          </s:complexType>\r\n        </s:element>\r\n      </s:choice>\r\n    </s:complexType>\r\n    <s:unique name=\"Constraint1\" msdata:PrimaryKey=\"true\">\r\n      <s:selector xpath=\".//SQL\" />\r\n      <s:field xpath=\"ID\" />\r\n    </s:unique>\r\n  </s:element>\r\n</s:schema>\r\n<diffgr:diffgram xmlns:msdata=\"urn:schemas-microsoft-com:xml-msdata\" xmlns:diffgr=\"urn:schemas-microsoft-com:xml-diffgram-v1\">\r\n<ListByName xmlns=\"\">\r\n</ListByName>\r\n</diffgr:diffgram>\r\n</GetByNameResult></GetByNameResponse></SOAP-ENV:Body>\r\n</SOAP-ENV:Envelope>\r\n",
          "comment" : ""
        },
        "redirectURL" : "",
        "headersSize" : 407,
        "bodySize" : -1,
        "comment" : ""
      },
      "cache" : { },
      "timings" : {
        "comment" : "",
        "ssl" : -1,
        "blocked" : -1,
        "dns" : -1,
        "send" : 0,
        "wait" : 0,
        "receive" : 0,
        "connect" : 0
      },
      "comment" : "",
      "_katalonRequestInformation" : {
        "name" : "6",
        "testObjectId" : "Object Repository/API/SOAP/GetByName",
        "harId" : "aa3c87de-23f6-48e3-88c4-f29c8750295a",
        "reportFolder" : null
      },
      "time" : 0
    } ],
    "comment" : ""
  }
}